{
  "Version": "1.3",
  "ID": "f1ppaoo2goltrhpkak5frot6b7nn5sxuxrasietfq",
  "Issue Number": "7",
  "Client": {
    "Name": "HTL",
    "Region": "China",
    "Industry": "Information, Media & Telecommunications",
    "Website": "https://www.xinpianchang.com/",
    "Social Media": "2428581996@qq.com",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "our company has dedicated itself to crafting and distributing top-tier short video content designed for entertainment, covering a broad spectrum of themes such as adventure, fitness, daily living, and imaginative narratives. Our goal is to captivate a global audience with visually stunning and engaging clips, using advanced tools and platforms to make these videos easily accessible and enjoyable. This DataCap proposal seeks to archive our diverse collection of entertaining short videos on the Filecoin network, guaranteeing their safety, reliability, and enduring accessibility for viewers across the globe.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "This dataset features a rich variety of recreational video content, encompassing areas such as entertainment, exploration, athletic activities, and everyday living. The videos are presented in high-definition quality, meticulously compressed and processed to ensure smooth streaming and efficient downloading. By hosting this data on the Filecoin network, we guarantee its resilience against data loss, fortified protection against unauthorized access, and effortless availability for a global audience, anytime and anywhere.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "The data will undergo local processing, including compression, conversion, and standardization, utilizing tools such as FFmpeg to ensure all videos meet the necessary requirements for storage and transmission. Following this, the graphsplit program will be employed to generate a .car file that adheres to the specified standards. Finally, the venus tool will be used to package the data, ensuring it is optimized for secure and efficient storage on the Filecoin network.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://www.xinpianchang.com/a10666931?from=IndexPick&part=%E7%8C%9C%E4%BD%A0%E6%83%B3%E7%9C%8B&index=16\nhttps://www.xinpianchang.com/a11906694?from=IndexPick&part=%E7%8C%9C%E4%BD%A0%E6%83%B3%E7%9C%8B&index=18",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Daily",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Asia other than Greater China, Europe, North America",
    "How will you be distributing your data to storage providers": "Venus built-in data transfer, Shipping hard drives, HTTP or FTP server",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03298672 DE\nf03298673 DE\nf03308933 UK\nf03308920 JP \nf03308922 JP\n\nf03385462 US\nf03385456 US\nf03402285 CN\nf03402308 CN\nf03402347 SP\nf03402379 SP",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "4PiB",
    "Single Size Dataset": "800TiB",
    "Replicas": 5,
    "Weekly Allocation": "800TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-03-05 10:03:35.824868106 UTC",
    "Validated By": "maxvint",
    "Active": true,
    "Updated At": "2025-03-05 10:03:35.824863610 UTC",
    "Active Request ID": "6c557686-17a9-4069-9ad8-c875eea32dab",
    "On Chain Address": "f1ppaoo2goltrhpkak5frot6b7nn5sxuxrasietfq",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "6c557686-17a9-4069-9ad8-c875eea32dab",
      "Request Type": "First",
      "Created At": "2025-03-05 10:00:19.326421467 UTC",
      "Updated At": "2025-03-05 10:00:19.326422651 UTC",
      "Active": false,
      "Allocation Amount": "400 TiB",
      "Signers": [
        {
          "Github Username": "maxvint",
          "Signing Address": "f1bv4fwfmiuww25jhwqvtjsjofxu77iyhqac4j6qy",
          "Created At": "2025-03-05 10:03:33.175000000 UTC",
          "Message CID": "bafy2bzacea7ajt3kupu7znyfytvazniuo5a3wbwf2dw4gem2ettwoddi2fevo"
        }
      ]
    }
  ]
}